---
kind: type
id: T:Autodesk.Revit.DB.PointOnPlane
source: html/ca9299cc-2931-1a63-cacb-a41f20baf7f1.htm
---
# Autodesk.Revit.DB.PointOnPlane

Define a ReferencePoint relative to a planar reference.

## Syntax (C#)
```csharp
public class PointOnPlane : PointElementReference
```

## Remarks
A ReferencePoint on a plane has its X and Y
basis vectors parallel to the plane, but is free to rotate
around its Z basis vector. It can lie on the plane
or have an offset.